АлогистикТест2/src/Documents/алк_СборкаСухихПакетов/алк_СборкаСухихПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_СборкаСухихПакетов</name>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПиломатериалыПереданныеНаСушку</registerRecords>
  <registerRecords>InformationRegister.алк_ПараметрыПакетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаПродукции</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСырье</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаСырье</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемСырье</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаОтходы</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаСырье</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_СборкаСухихПакетов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиКоманд

&НаКлиенте
Процедура ЗаполнитьПродукцию(Команда)
	
	ЗаполнитьПродукциюЗавершение = Новый ОписаниеОповещения("ЗаполнитьПродукциюЗавершение", ЭтотОбъект);
	Если Объект.Продукция.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru='В табличной части уже заполнены строки. Очистить табличную часть?'");
		
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.Добавить("Перезаполнить");
		СписокВыбора.Добавить("Отмена");
		
		ПоказатьВопрос(ЗаполнитьПродукциюЗавершение, ТекстВопроса, СписокВыбора); 
	Иначе
		ВыполнитьОбработкуОповещения(ЗаполнитьПродукциюЗавершение, "Перезаполнить");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазбитьСтроку(Команда)
	
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВвода = Новый Структура;
	ПараметрыВвода.Вставить("ПоляВвода", Новый Массив);
	ПараметрыВвода.Вставить("ЗаголовокФормы", "Укажите значения для новой строки");
	
	КвалификаторЧислаКоличество = Новый КвалификаторыЧисла(10, 0);
	КвалификаторЧислаОбъем = Новый КвалификаторыЧисла(15, 3);
	
	РеквизитКоличество = Новый Структура;
	РеквизитКоличество.Вставить("Имя", "Количество");
	РеквизитКоличество.Вставить("Тип", Новый ОписаниеТипов("Число",,,КвалификаторЧислаКоличество));
	РеквизитКоличество.Вставить("Заголовок", "Количество");
	
	РеквизитОбъем = Новый Структура;
	РеквизитОбъем.Вставить("Имя", "Объем");
	РеквизитОбъем.Вставить("Тип", Новый ОписаниеТипов("Число",,,КвалификаторЧислаОбъем));
	РеквизитОбъем.Вставить("Заголовок", "Объем");
	
	ПараметрыВвода.ПоляВвода.Добавить(РеквизитКоличество);
	ПараметрыВвода.ПоляВвода.Добавить(РеквизитОбъем);
	
	ОповещениеЗавершениеВвода = Новый ОписаниеОповещения("ЗавершениеВводаРазбиенияСтроки", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.алк_ФормаВводаДанных", ПараметрыВвода, ЭтаФорма,,,, ОповещениеЗавершениеВвода, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПродукцияХарактеристикаСырьеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Номенклатура = ПродукцияХарактеристикаСырьеПриИзмененииНаСервере(ТекущиеДанные.ХарактеристикаСырье);
	
КонецПроцедуры

&НаСервере
Процедура ДатаСменыПриИзмененииНаСервере()
	Объект.Дата = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(Объект.Смена, Объект.ДатаСмены).ДатаВремяКонцаСмены;
КонецПроцедуры

&НаКлиенте
Процедура ДатаСменыПриИзменении(Элемент)
	ДатаСменыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СменаПриИзмененииНаСервере()
	Объект.Дата = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(Объект.Смена, Объект.ДатаСмены).ДатаВремяКонцаСмены;
КонецПроцедуры

&НаКлиенте
Процедура СменаПриИзменении(Элемент)
	СменаПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СервисныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьПродукциюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "Перезаполнить" Тогда
		Объект.Продукция.Очистить();
	ИначеЕсли Результат = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьПродукциюНаСервере();
	
	ОбновитьОтображениеДанных(Элементы.Продукция);
		
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПродукциюНаСервере()
	
	ОбъектДок = РеквизитФормыВЗначение("Объект");
	ОбъектДок.ЗаполнитьПродукциюПоДаннымРегистра();
	
	ЗначениеВРеквизитФормы(ОбъектДок.Продукция, "Объект.Продукция");	
			
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВводаРазбиенияСтроки(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Количество И Результат.Объем = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
	Количество = ТекущиеДанные.Количество - Результат.Количество;
	Объем = ТекущиеДанные.Объем - Результат.Объем;
	
	ТекущиеДанные.Количество = Количество;
	ТекущиеДанные.Объем = Объем;
	
	НоваяСтрока = Объект.Продукция.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные,, "Количество, Объем"); 
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат); 
	
	Модифицированность = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПродукцияХарактеристикаСырьеПриИзмененииНаСервере(ХарактеристикаСырье)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ХарактеристикаСырье, "Владелец");
КонецФункции

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти
